scores = {
    # 1 критерий, все отлично
    1 : [8],
    # 2 Получение стипендии
    2: {
        # международная
        1: {
            # победитель
            1: {
                # очно
                1: [8, 5, 3, 1],
                # заочно
                2: [3, 2, 1]
            },
            # призёр
            2: {
                # очно
                1: [7, 4, 2, 0.5],
                # заочно
                2: [2.5, 1.5, 0.5]
            }
        },
        # СНГ
        2: {
            # победитель
            1: {
                # очно
                1: [5, 3, 2, 0.5],
                # заочно
                2: [2.5, 1.5, 0.5]
            },
            # призёр
            2: {
                # очно
                1: [4, 2.5, 1.5, 0.5],
                # заочно
                2: [2, 1.5, 0.5]
            }
        },
        # Федеральный уровень
        3: {
            # победитель
            1: {
                # очно
                1: [3, 2, 1],
                # заочно
                2: [1.5, 1, 0.5]
            },
            # призёр
            2: {
                # очно
                1: [2, 1.5, 0.5],
                # заочно
                2: [1, 0.6, 0.4]
            }
        },
        #На уровне ВУЗа
        4: {
            # победитель
            1: {
                1: [1, 0.6, 0.4]
            },
            # призёр
            2: {
                1: [0.5, 0.3, 0.2]
            }
        }
    },
    #олимпиады
    3 : {
        #международная
        1 : {
            #победитель
            1 : {
                # очно
                1: [13, 8, 5, 3, 1],
                # заочно
                2: [3, 2, 1]
            },
            #призёр
            2 : {
                # очно
                1: [11, 7, 4, 2],
                # заочно
                2: [2.5, 1.5, 0.5]
            }
        },
        #СНГ
        2 : {
            #победитель
            1 : {
                # очно
                1: [9, 6, 3, 1],
                # заочно
                2: [2.5, 1.5, 0.5]
            },
            #призёр
            2 : {
                # очно
                1: [7, 5, 2],
                # заочно
                2: [2, 1.5, 0.5]
            }
        },
        #Федеральный уровень
        3 : {
            #победитель
            1 : {
                # очно
                1: [5, 3, 2],
                # заочно
                2: [1.5, 1, 0.5]
            },
            #призёр
            2 : {
                # очно
                1: [4, 2.5, 1.5],
                # заочно
                2: [1, 0.6, 0.4]
            }
        }
    },
    # Научно-исследовательские работы
    4 : {
        #приз за научную работу
        1: {
            1: [7, 4, 3, 1]
        },
        # интеллектуальное деятельность
        2: {
            # индивидуальные
            1: {
                1: [15, 9, 6, 3],
            },
            # коллективные
            2: {
                1: [10, 6, 4, 1],
            }
        },
        # Личный грант (зачем вообще давать деньги этим людям???)
        3: {
            1: [13, 8, 5, 3, 1],
        },
        # Исполнитель гранта
        4: {
            1: [8, 5, 3, 1],
        },
    },
    # Научно-исследовательские работы
    5 : {
        # Статьи
        #Зарубежные
        # Scopus
        #Q1
        1: {
            #иностранный язык
            1 : [20, 12, 8, 4, 2, 1],
            #русский язык
            2 : [10, 6, 4, 2, 1]
        },
        # Q2
        2 : {
            # иностранный язык
            1: [15, 9, 6, 3, 1],
            # русский язык
            2: [10, 6, 4, 2, 1]
        },
        # not Scopus
        3 : [9, 5, 4, 2, 1],


        #ММК
        # Scopus ( только на иностранном)
        4 : {
            #СДнСК УД
            1 : [29, 17, 12, 7, 2],
            #СДнСК СД
            2 : [20, 12, 8, 4, 2, 1],
            #БДнСК
            3 : [15, 9, 6, 3, 1]
        },
        # not Scopus (на любом языке)
        5 : {
            # СДнСК УД
            1: [18, 11, 7, 3],
            # СДнСК СД
            2: [12, 8, 4, 1],
            # БДнСК
            3: [9, 5, 4, 2, 1]
        },
        #Рос. издания
        # Scopus
        6: [10, 6, 4, 2, 1],
        # VAK
        7: [8, 4.5, 3.5, 1],
        # Not Index
        8 : [5, 3, 2, 0.5],

        # Тезисы
        # Зарубежные
        9 : {
            # Иностранный язык
            1 : [4, 2.5, 1.5, 0.5],
            # Русский язык
            2 : [3, 2, 1]
        },
        # ММК
        # Scopus
        10 : {
            # СДнСК УД
            1 : {
                # Иностранный язык
                1: [4, 2.5, 1.5, 0.5],
                # Русский язык
                2: [3, 2, 1]
            },
            # СДнСК СД
            2 : {
                # Иностранный язык
                1: [4, 2.5, 1.5, 0.5],
                # Русский язык
                2: [3, 2, 1]
            },
            # БДнСК
            3  : {
                # Иностранный язык
                1: [4, 2.5, 1.5, 0.5],
                # Русский язык
                2: [3, 2, 1]
            },
        },
        # not Scopus
        11 : {
            # СДнСК УД
            1: [7, 4, 3, 1],
            # СДнСК СД
            2: [4, 2.5, 1.5, 0.5],
            # БДнСК
            3: [2, 1.3, 0.7]
        },
        # Российские издания
        12 : [2, 1.3, 0.7]
    },
    # Общественный движ
    6 : {
        # Организация учебных мероприятий
        1 : {
            # межд. уровень
            1 : [8, 5, 3],
            # всероссийский уровень
            2 : [6, 4, 2],
            # федеральный
            3 : [4, 2.5, 1.5],
            # уровень вуза
            4 : [3, 2, 1],
            # подразделение вуза
            5 : [2, 1.5, 0.5]
        },
        # Организация социальных мероприятий
        2 : {
            # межд. уровень
            1: [6, 4, 2],
            # всероссийский уровень
            2: [4, 2.5, 1.5],
            # федеральный
            3: [3, 2, 1],
            # уровень вуза
            4: [2, 1.5, 0.5],
            # подразделение вуза
            5: [1, 0.5]
        },
        # Членство в жюри
        3 : {
            #Очный
            1 : [4],
            #Заочный
            2 : [3]
        },
        # Без-возд-мезд-но учить
        4 : {
            #студентов
            1 : [7],
            #школьников
            2 : [4, 2]
        }
    },
    # Информациооное обеспечение движей
    7 : {
        # Печать
        1 : {
            1 : [5],
            2 : [4],
            3 : [3],
            4 : [2],
            5 : [1, 1],
        },
        # SMM
        2 : {
            1 : [3],
            2 : [1, 1],
            3 : [2, 1]
        },
        # Сайт
        3 : {
            1 : [2, 1],
            2 : [1, 0.5]
        },
        # Секретарь найчной конференции
        4 : [3, 3, 1]
    },
    # Культурно-творческая деятельность
    8 : {
        1 : {
            # очное
            1 : [8, 5, 3, 1],
            # заочное
            2 : [4, 2.5, 1.5]
        },
        2 : {
            # очное
            1: [6, 4, 0.5],
            # заочное
            2: [3, 2, 1]
        },
        3 : {
            # очное
            1: [4, 2.5, 1.5],
            # заочное
            2: [2, 1.3, 0.7]
        },
        4 : {
            # очное
            1: [2, 1.3, 0.7],
            # заочное
            2: [1, 0.6, 0.4]
        }
    },
    # публичные культурные мероприятия
    9 : {
        1 : {
            # очное
            1 : [8, 5, 3, 1],
            # заочное
            2 : [3, 2, 1]
        },
        2 : {
            # очное
            1: [5, 3, 2],
            # заочное
            2: [2, 1.2, 0.8]
        },
        3 : {
            # очное
            1: [2, 1.2, 0.8],
            # заочное
            2: [0.8, 0.5, 0.3]
        }
    },
    10 : {
        1: {
            # Руководитель
            1 : [8, 5, 3],
            # Организатор
            2 : [6, 4, 2],
            # Волонтер
            3 : [4, 2.5, 1.5],
            # Участник
            4 : [3, 2, 1]
        },
        2: {
            # Руководитель
            1: [6, 4, 2],
            # Организатор
            2: [4, 2.5, 1.5],
            # Волонтер
            3: [3, 2, 1],
            # Участник
            4: [2, 1.5, 0.5]
        },
        3: {
            # Руководитель
            1: [4, 2.5, 1.5],
            # Организатор
            2: [3, 2, 1],
            # Волонтер
            3: [2, 1.5, 0.5],
            # Участник
            4: [1, 0.5]
        },
        4: {
            # Руководитель
            1: [3, 2, 1],
            # Организатор
            2: [2, 1.5, 0.5],
            # Волонтер
            3: [1, 0.5],
            # Участник
            4: [0.5, 0.3, 0.2]
        },
        5: {
            # Руководитель
            1: [2, 1.5, 0.5],
            # Организатор
            2: [1, 0.5],
            # Волонтер
            3: [0.5, 0.3, 0.2]
        }
    },
    11 : {
        1 : {
            # победитель
            1 : [10, 6, 4, 2, 1],
            # призёр
            2 : [9, 5.5, 3.5, 1.5, 0.5]
        },
        2 : {
            # победитель
            1: [8, 5, 3, 1, 0.5],
            # призёр
            2: [7, 4.5, 2.5, 0.5]
        },
        3 : {
            # победитель
            1: [5, 3, 2, 0.5],
            # призёр
            2: [4, 2.5, 1.5]
        }
    },
    # Спорт
    12: {
        1: {
            # победитель
            1: [3, 2, 1],
            # призёр
            2: [2, 1.5, 0.5]
        },
        2: {
            # капитан
            1: [3, 2, 1],
            # член команды
            2: [2, 1.5, 0.5]
        },
        3 : [3, 2, 1]
    },
    # ГТО
    13 : [4]
}